{
  "basics": {
    "name": "Kwok Yuen FAN",
    "label": "Assistant Professor of Economics and Finance",
    "image": "",
    "email": "kyfan@hsu.edu.hk",
    "phone": "",
    "url": "https://kwokyuenfan.github.io/",
    "summary": "Kwok Yuen Fan is an assistant professor of economics and finance at the Hang Seng University of Hong Kong. He received his Ph.D. in Real Estate Economics from Hong Kong Polytechnic University. His research focuses on Sustainability, Real Estate Economics and Finance, and Corporate Finance. He passed the CFA Level III and FRM Part II examinations and has several published papers in reputable journals such as the World Development, International Review of Financial Analysis, Journal of Real Estate Finance and Economics and Journal of Real Estate Research.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Hong Kong",
      "countryCode": "HK",
      "region": "Hong Kong"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "kwokyuenfan",
        "url": "https://kwokyuenfan.github.io/"
      }
    ]
  },
  "work": [
    {
      "company": "The Hang Seng University of Hong Kong (HSUHK)",
      "position": "Assistant Professor of Economics and Finance",
      "url": "https://www.hsu.edu.hk/en/teaching-learning/academic-staff/?staffId=1279",
      "startDate": "2025-09-01",
      "endDate": "",
      "summary": "",
      "highlights": [
        "Lecturer, Urban and Real Estate Economics",
        "Lecturer, Business Economics"
      ]
    },
    {
      "company": "Beijing Normal-Hong Kong Baptist University (BNBU) United International College",
      "position": "Assistant Professor of Finance",
      "url": "https://uic.edu.cn/en/",
      "startDate": "2023-09-01",
      "endDate": "2025-08-31",
      "summary": "",
      "highlights": [
        "Lecturer, Financial Forecasting (4.97/5.00)",
        "Lecturer, Business Research Method (4.89/5.00)",
        "Lecturer, Financial Management (4.96/5.00)",
        "Lecturer, Corporate Finance (4.76/5.00)",
        "Lecturer, Multinational Finance (4.93/5.00)"
      ]
    },
    {
      "company": "The Hong Kong Polytechnic University",
      "position": "Research Assistant",
      "url": "https://www.polyu.edu.hk/",
      "startDate": "2020-09-01",
      "endDate": "2023-08-31",
      "summary": "",
      "highlights": [
        "Tutor, Development Finance and Investment",
        "Tutor, Construction Economics",
        "Tutor, Business Valuation and Accounts"
      ]
    },
    {
      "company": "Deloitte Touche Tohmatsu",
      "position": "Associate",
      "url": "https://www.deloitte.com/cn/en.html",
      "startDate": "2019-01-01",
      "endDate": "2019-12-31",
      "summary": "Industry Experience",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "The Hong Kong Polytechnic University",
      "location": {
        "city": "Hong Kong",
        "countryCode": "HK"
      },
      "url": "https://www.polyu.edu.hk/",
      "area": "Real Estate Economics",
      "studyType": "Ph.D.",
      "startDate": "2020-09-01",
      "endDate": "2023-08-31",
      "score": "",
      "courses": ["Thesis: Institutional designs and environmental governance"]
    },
    {
      "institution": "Nanyang Technological University, Nanyang Business School",
      "location": {
        "city": "Singapore",
        "countryCode": "SG"
      },
      "url": "https://www.ntu.edu.sg/nbs",
      "area": "Research (Business/Finance)",
      "studyType": "Visiting Research Student",
      "startDate": "2023-01-01",
      "endDate": "2023-06-30",
      "score": "",
      "courses": []
    },
    {
      "institution": "Lancaster University",
      "location": {
        "city": "Lancaster",
        "countryCode": "GB"
      },
      "url": "https://www.lancaster.ac.uk/",
      "area": "Advanced Financial Analysis",
      "studyType": "M.Sc.",
      "startDate": "2017-10-01",
      "endDate": "2018-09-30",
      "score": "Distinction",
      "courses": [
        "Dissertation: The cross-sectional profitability of idiosyncratic volatility and its common pattern for stock returns: Empirical evidence from the U.S. markets"
      ]
    },
    {
      "institution": "The Hang Seng University of Hong Kong",
      "location": {
        "city": "Hong Kong",
        "countryCode": "HK"
      },
      "url": "https://www.hsu.edu.hk/",
      "area": "Business Administration",
      "studyType": "BBA",
      "startDate": "2012-09-01",
      "endDate": "2016-08-31",
      "score": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "3rd IETI PhD Fellowship Award Winner",
      "date": "2024-01-01",
      "awarder": "International Engineering and Technology Institute (IETI)",
      "summary": ""
    },
    {
      "title": "Best Conference Paper Prize",
      "date": "2024-01-01",
      "awarder": "2024 China Real Estate Academic Annual Conference",
      "summary": "Paper: An Institutional Perspective of Selective ESG Engagement"
    },
    {
      "title": "Best Conference Paper Prize",
      "date": "2023-01-01",
      "awarder": "2023 China Real Estate Academic Annual Conference",
      "summary": "Paper: The Value of Sustainable Property Management in Real Estate: Evidence from Hong Kong"
    }
  ],
  "certificates": [
    {
      "name": "CFA Level III",
      "issuer": "CFA Institute"
    },
    {
      "name": "FRM Part II",
      "issuer": "Global Association of Risk Professionals (GARP)"
    },
    {
      "name": "Ronald Coase Institute Workshop Alumni",
      "issuer": "Ronald Coase Institute"
    }
  ],
  "publications": [
    {
      "name": "Performance measurability, local government’s incentives, and regional air pollution reduction",
      "publisher": "World Development",
      "releaseDate": "2025",
      "url": "https://doi.org/10.1016/j.worlddev.2025.107056",
      "summary": "Enhanced environmental performance measurability leads to improved environmental quality, particularly when local leaders possess strong career incentives and their financial support is directly contingent on successful environmental protection outcomes."
    },
    {
      "name": "Why high-speed rail causes heterogeneous spatial patterns in firm innovation: Perspectives from intensive and extensive margins",
      "publisher": "PloS one",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1371/journal.pone.0311621",
      "summary": "This paper decompose the impact of high-speed rail (HSR) on firm innovation into extensive (more firms innovating) and intensive (firms innovating more) margins, revealing that the net positive effect is a trade-off between beneficial knowledge spillovers and a detrimental \"brain drain\" from peripheral counties to urban centers. While HSR boosts overall innovation, it can exacerbate regional inequality, necessitating targeted policies to support innovation in peripheral areas and mitigate the brain drain effect."
    },
    {
      "name": "ESG components and equity returns: Evidence from real estate investment trusts",
      "publisher": "International Review of Financial Analysis",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1016/j.irfa.2024.103716",
      "summary": "For US Real Estate Investment Trusts (REITs), this study finds that higher environmental performance negatively impacts future stock returns and firm fundamentals, while social and governance performance are positively associated with both. These contrasting effects stem from environmental investments' high costs versus the benefits of social and governance practices, underscoring that ESG's influence on equity returns is component-specific."
    },
    {
      "name": "The value of sustainable property management in real estate: Evidence from Hong Kong",
      "publisher": "Journal of Real Estate Research",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1080/08965803.2024.2346413",
      "summary": "ESG performance of property management companies is capitalized into housing prices, with the value premium driven by a reduction in perceived risk and a higher rental growth rate rather than by higher gross rents. Management firms can directly enhance property values by improving ESG practices, and investors should incorporate this non-physical attribute into their valuations."
    },
    {
      "name": "The valuation effect and consequences of clawback adoption in real estate investment trusts",
      "publisher": "The Journal of Real Estate Finance and Economics",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1007/s11146-022-09909-w",
      "summary": "Clawback provisions are a value-relevant corporate governance mechanism even in the highly regulated REIT market, as investors positively value the adoption of strong policies, particularly in firms with higher prior financial restatement risk and disclosure opacity. Adopting such policies tangibly improves REIT governance by reducing the likelihood of financial restatements, enhancing the quality of financial disclosures, and curbing aggressive investment."
    },
    {
      "name": "Did real estate professionals anticipate the 2007-2008 financial crisis? Evidence from insider trading in the REITs",
      "publisher": "The Journal of Real Estate Finance and Economics",
      "releaseDate": "2021",
      "url": "https://doi.org/10.1007/s11146-020-09763-8",
      "summary": "Real estate professionals in REITs anticipated the 2007-2008 financial crisis by significantly selling their holdings as early as 2004, which refutes the competing \"biased belief hypothesis\" that they were over-optimistic. Unlike many experts in the broader financial industry, these sophisticated real estate insiders successfully foresaw the systemic risk in the housing market, suggesting their trading patterns can act as an early warning signal for sector-wide bubbles."
    },
    {
      "name": "The beta anomaly in the REIT market",
      "publisher": "The Journal of Real Estate Finance and Economics",
      "releaseDate": "2021",
      "url": "https://doi.org/10.1007/s11146-020-09784-3",
      "summary": "The beta anomaly in the REIT market and providing evidence that it is driven by institutional investors' preference for high-beta assets, which supports the leverage constraints hypothesis over alternative explanations. This institutional demand inflates the prices of high-beta REITs, causing their subsequent risk-adjusted underperformance and creating profitable opportunities for strategies that bet against beta."
    }
  ],
  "skills": [],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Chinese",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Sustainability",
      "keywords": ["Climate change", "Biodiversity", "Greenwashing"]
    },
    {
      "name": "Real Estate",
      "keywords": ["Climate resilience", "Green buildings", "Land"]
    },
    {
      "name": "Corporate Finance",
      "keywords": ["Fintech", "Blended Finance", "Political Economy"]
    }
  ],
  "references": [
    {
      "name": "Jeff Jianfu Shen",
      "reference": "PhD Supervisor, Associate Professor, Department of Building & Real Estate, The Hong Kong Polytechnic University, jeff.jf.shen@polyu.edu.hk"
    },
    {
      "name": "Eddie C.M. Hui",
      "reference": "PhD Supervisor, Chair Professor; Department Head, Department of Public and International Affairs, City University of Hong Kong, chimhui@cityu.edu.hk"
    },
    {
      "name": "Xin Chang",
      "reference": "Professor; Associate Dean (Research), Nanyang Business School, Nanyang Technological University, changxin@ntu.edu.sg"
    },
    {
      "name": "Weimin Liu",
      "reference": "Chair Professor; Associate Dean, Faculty of Business and Management, Beijing Normal - Hong Kong Baptist University, weiminliu@uic.edu.cn"
    }
  ],
  "projects": [
    {
      "name": "Environmental Materiality in ESG Strategy: A REIT Perspective",
      "description": "This study examines the role of environmental materiality in the environmental, social and governance (ESG) strategies adopted by real estate investment trusts (REITs) in the US. Due to the large investment required to improve environmental performance, REITs may undertake strategic ESG efforts by focusing more on the social and governance pillars than the environmental pillar. Our study finds that these strategic ESG practices of REITs, measured by strategic ESG scores, are associated with better revenue growth, higher profitability and larger asset expansion. The long–short portfolios, which long stocks with higher strategic ESG scores and short stocks with lower strategic ESG scores, generate positive risk-adjusted returns of 0.558% (0.821%) per month under an equal-weighted (value-weighted) scheme. Stocks with higher strategic ESG scores are also associated with higher long-term valuations, as measured by Tobin’s Q and buy-and-hold returns, and larger institutional ownership. The strategic ESG practices, however, have adverse environmental consequences, resulting in increased greenhouse gas emissions and environmental damage costs.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Regulatory Arbitrage by Governments and Land Conveyance",
      "description": "The pollution haven hypothesis argues that polluting firms strategically respond to the imbalance in environmental regulations; and yet the role of local governments in facilitating the reallocation of polluting activities has not been examined. This study investigates the impact of local government’s strategical response induced by geographically imbalanced regulations on industrial land conveyance to polluting industries in China. Following the Clean Air Action 2013, counties bordering regions with stricter air pollution regulations conveyed more land to polluting industries than those that do not. In bordering counties, land conveyance prices were strategically manipulated, indicating that the increase in land allocation was driven by deliberate price reductions by local governments to attract polluting activities. The effect was more pronounced in counties with lower environmental attention and higher political ambitions among officials. Lastly, deliberate creation of pollution haven led to enhanced economic growth and exacerbated air pollution. These findings underscore the urgent need for coordinated policy efforts to address the unintended consequences of environmental regulation imbalances, thereby emphasizing the importance of the issue to the audience.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "An Institutional Perspective of Selective ESG Engagement",
      "description": "This study examines how institutional factors shape the selective engagement of environmental, social, and governance (ESG) practices in Real Estate Investment Trusts (REITs) across different regions. The resource-based view suggests that REITs may prioritize social and governance practices over environmental investment due to resource constraints. Analyzing 302 REITs from the U.S., Europe, and Asia (2012-2022), our study finds that institutional factors—environmental policy strictness and investor attitudes—lead to different outcomes: selective ESG strategies enhance profitability and market valuation in the U.S. but reduce them in Europe. These findings emphasize the critical role of institutional contexts in shaping corporate sustainability.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Does integrating environmental protection in cadre evaluation system mitigate the race-to-the-bottom competition? Evidence from industrial land conveyance in China",
      "description": "This study examines the impact of integration of environmental considerations into the political evaluations on the race-to-the-bottom competition in the land market. By analyzing over 250,000 industrial land transactions from 279 cities between 2007 and 2018, we find that local officials frequently reduced land prices to attract investment, particularly in regions with intense economic competition and when facing major political reviews. Our difference-in-differences analysis reveals that the introduction of environmental protection as a criterion in the cadre evaluation system in 2013 significantly mitigated the race-to-the-bottom competition in land conveyancing. Moreover, heightened environmental monitoring pressures have led local officials to be less inclined to sell industrial land at lower prices. This study contributes to the understanding of how political incentives and environmental policies interact to influence local officials’ resource allocation decisions, with implications for both environmental quality and economic performance. Our findings suggest that integrating environmental considerations into political evaluations can effectively reduce the race-to-the-bottom competition among local officials and promote sustainable development.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Lobbying and Fossil Fuel Investment",
      "description": "This study explores the impact of the lobbying activities of oil and gas companies on their corporate investment decisions. Using a sample of listed oil and gas companies in the U.S. from 2000 to 2019, this study finds that in comparison with non-lobbying firms, lobbying companies’ capital expenditures increase by 6.2% and their oil and gas reserves’ growth rate increases by 16.4% in the year following lobbying. The amount of lobbying expenditures is also positively associated with fossil fuel investments. The results remain robust when an instrumental variable approach is applied to address endogeneity concerns. Our plant-level analysis indicates that political lobbying by fossil fuel parent companies does not enhance abatement investment alongside conventional energy, but instead, it raises pollution emissions. Further investigation shows that lobbying activities significantly boost the financial performance of fossil fuel companies without reducing their political risks or exposure to climate change policy uncertainty. Taken together, this study suggests that lobbying improves the financial performance of oil and gas companies and leads to an increase in their fossil fuel investments.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Environmental Regulatory Independence and Corporate Environmental Performance",
      "description": "We examine the impact of environmental regulatory independence on corporate environmental performance. Before 2016, local and central state-owned enterprises (SOEs) in China headquartered in jurisdictions far from central government supervision had poor environmental performance. The 2016 environmental verticalization reform transferred the management authority of local Environmental Protection Bureaus (EPBs) from local governments to provincial EPBs. We find that local SOEs’ corporate environmental performance significantly improves as local EPBs gain more regulator independence. However, the reform did not affect the environmental performance of central SOEs, which often outrank provincial EPBs, or privately owned enterprises (POEs), which were already managed by local EPBs before the reform. Further analysis indicates that the improvement in corporate environmental performance depends upon local governments’ environmental attention and regulatory capture. Although local SOEs increased abatement investments, the reform does not negatively affect their revenue, profitability, and valuation. This study suggests that policymakers should consider political rankings to improve environmental governance and enhance transparency in regulatory processes to mitigate rent-seeking behaviors.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Performance Measurability and Air Pollution Control: Evidence from a Quasi-experiment in China",
      "description": "This study examines the impact of performance measurability on the effectiveness of local governments in mitigating air pollution. Utilizing a difference-in-differences (DiD) approach, which leverages the 2013 Air Pollution Prevention and Control Action Plan in China, this study finds a substantial and negative correlation between performance measurability on PM2.5 concentration. Mechanism analysis finds that the reduction in PM2.5 concentration is more pronounced in cities managed by leaders with stronger political promotion incentives (career concern incentive), and in those that are more reliant on financial transfers from the central government (financial incentive). Further analysis highlights the role of performance measurability in prompting genuine governmental efforts in environmental conservation. Our study emphasizes the importance of transparent reporting of environmental data in advancing sustainable development in developing countries.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Climate Lobbying under uncertainty: Corporate Strategies and consequences",
      "description": "Working paper.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "The Price of Pandemic Fear in the Residential Rental Market: Evidence from Hong Kong",
      "description": "Working paper.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Can fintech enhance household climate resilience? Evidence from P2P lending platform",
      "description": "Working paper.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Leverage constraints and financial manipulation in the real estate sector",
      "description": "Working paper.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Developer’s ESG Reputation Concern and Green Building Development",
      "description": "Working paper.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Property presale and extra-budgetary revenue",
      "description": "Data cleaning in progress.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Unfinished buildings and loan suspension",
      "description": "Data cleaning in progress.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    },
    {
      "name": "Judicial independence and audit costs",
      "description": "Manuscript in progress.",
      "highlights": [],
      "startDate": "",
      "endDate": ""
    }
  ]
}
